Autodesk.Revit.DB.BaseArray.NumMembers
Retrieves or changes the number of the arrayed members.
Remarks: In projects, the minimum value is 2 for linear arrays and 3 for radial arrays.
In families, the minimum value is 0 for all arrays. The maximum value is 200.